       identification                                         division .
       program-id. Aula25.
       data                                                   division .
       file                                                    section .
       working-storage                                         section .
       77 ws-num1      pic 99 value zeros.
       77 ws-num2      pic 99 value zeros. 
       
       procedure                                              division .
       main-procedure.
           
           set ws-num1 to 1.

           display ws-num1

           stop run.
       end program Aula25.
       
       
       
       